Repository: rahafrouz/quantum-switching
Catalog: qswitch-*.po
Languages: fa

source: You want to switch this SDN. Tell me the channel number (1 or 2) :
fa: خب! شما میخواهید این اس دی ان رو تغییر بدهید. لطفا بفرمایید به کدامین کانال میخواهید تغییر پیدا کنید؟ ۱ یا ۲؟

source: Please Enter k or m.
fa: ببین فقط حرف ک یا ام را به صورت لاتین وارد کن

source: Continue?
fa: بازم بریم؟

source: Error:
fa: ای بابا

source: This is the help :
fa: به این میگن کمک!

source: Here are the Options:
fa: اینها گزینه های شما برای کنترل دنیا هستند

source: Showing the help
fa: الان داریم راهنما را نمایش میدیم

source: If this option is entered, the worker process would be over net and you must enter ip and port of the worker. otherwise it is local.
fa: اگر این گزینه وارد شود، عملیات به صورت شبکه ای انجام خواهد شد و در این صورت باید آی پی و پورت کارگر رو هم در ادامه وارد کنید. در غیر این صورت همه چیز به صورت محلی خواهد بود.

source: port number of worker
fa: شماره پورت کارگر

source: host address of worker
fa: آدرس کارگر

source: This option indicate port number of the rest-forward app. Usually, It is 8080.
fa: شماره پورت برنامه رست فوروارد. اگر چیزی نمیدانید ۸۰۸۰ رو بزنید.

source: enter G for GUI, and T for TUI. IMPORTANT: THIS OPTION SHOULD BE THE LAST ONE SINCE THERE IS NO THREAD.
fa: برای رابط گرافی حرف گ و برای رابط ترمینالی حرف ت را به صورت لاتین وارد کنید. یادت باشد که این گزینه باید آخرین باشد.

source: You should enter an option. use -h for help
fa: بابا یه چیزی وارد کن. نمیدونی از گزینه اچ برای کمک استفاده کن.

source: Channel 1
fa: کانال ۱

source: Channel 2
fa: کانال ۲

source: Switched to channel: 2
fa: به کانال ۲ تغییر پیدا کرد.

source: Switched to channel: 1
fa: به کانال ۱ تغییر کرد.
